app/Validations/CustomRules.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'juan'
OR `email` = 'juan'
 LIMIT 1
---
    public function check_pass($value, string $usr, array $data, ?string &$error = "The password does not match"): bool
    {
        //creo un modelo de usuario para buscar al usuario en la base de datos
        $usuarioModel = new UsuarioModel();
        //se busca el usuario en función de como quiera ingresar el usuario, con su nombre de usuario o email
        $usuario = $usuarioModel->where('usuario',$data[$usr])->orWhere('email', $data[$usr])->first();