app/Controllers/Home.php

    public function __construct()
    {
        $this->productos = (new ProductoModel())->asArray()->where('baja', 0)->orderBy('id_producto', 'desc')->findAll();
        $this->clasificaciones = (new ClasificacionModel())->asArray()->where('baja_clasif', 0)->findAll();
        $this->subclasificaciones = (new SubclasificacionModel())->asArray()->where('baja_subclasif', 0)->findAll();
---
SELECT *
FROM `productos`
WHERE `baja` = 0
ORDER BY `id_producto` DESC
SELECT *
FROM `clasificacion`
WHERE `baja_clasif` = 0
SELECT *
FROM `subclasificacion`
WHERE `baja_subclasif` = 0

    public function index()
    {

        $data = [
            'titulo' => 'Server101',
            'rutas' => ['Principal'],
            'link' => ['principal'],
            'productos' => $this->productos,
            'clasificaciones' => $this->clasificaciones,
            'subclasificaciones' => $this->subclasificaciones,
            'productos' => $this->productos
        ];


        if (isset($_SESSION['usuario'])) {
            if ($_SESSION['tipo'] == 1) {

                $productos = (new ProductoModel())->join('clasificacion', 'tipo1=id_clasificacion')
                ->join('subclasificacion', 'tipo2=id_subclasif')
                ->where('baja', 0)->findAll();
                $bajas = (new ProductoModel())->join('clasificacion', 'tipo1=id_clasificacion')
                ->join('subclasificacion', 'tipo2=id_subclasif')
                ->where('baja', 1)->findAll();
---
SELECT *
FROM `productos`
JOIN `clasificacion` ON `tipo1`=`id_clasificacion`
JOIN `subclasificacion` ON `tipo2`=`id_subclasif`
WHERE `baja` = 0
SELECT *
FROM `productos`
JOIN `clasificacion` ON `tipo1`=`id_clasificacion`
JOIN `subclasificacion` ON `tipo2`=`id_subclasif`
WHERE `baja` = 1