app/Controllers/ProductoController.php

    public function __construct()
    {
        $this->clasificaciones = (new ClasificacionModel())->asArray()->where('baja_clasif', 0)->findAll();
        $this->subclasificaciones = (new SubclasificacionModel())->asArray()->where('baja_subclasif', 0)->findAll();
---
SELECT *
FROM `clasificacion`
WHERE `baja_clasif` = 0
SELECT *
FROM `subclasificacion`
WHERE `baja_subclasif` = 0

                $_POST['imagen'] = $imagen->getName();
            }

            if ($productos->update($id,$_POST) == false) {
---
UPDATE `productos` SET `codigo_producto` = '136427', `nombre` = 'Disco duro interno Seagate Barracuda ST500LM030 500GB plateado', `precio` = '16890', `descripcion` = 'Capacidad: 500 GB\r\n\r\nInterfaces: SATA III\r\n\r\nVelocidad de rotación: 5400 rpm\r\n\r\nTecnología de almacenamiento: HDD\r\n\r\nAplicaciones: Notebook\r\n\r\nFactor de forma: 2.5 \"', `tipo1` = '6', `tipo2` = '21', `stock` = '10', `imagen` = 'Disco_duro_interno_Seagate_Barracuda_ST500LM030_500GB_plateado_1.png'
WHERE `productos`.`id_producto` IN ('23')