app/Controllers/TiendaController.php

    public function __construct()
    {
        $this->productos = (new ProductoModel())->asArray()->where('baja', 0)->orderBy('id_producto', 'desc')->findAll();
        $this->clasificaciones = (new ClasificacionModel())->asArray()->where('baja_clasif', 0)->findAll();
        $this->subclasificaciones = (new SubclasificacionModel())->asArray()->where('baja_subclasif', 0)->findAll();
---
SELECT *
FROM `productos`
WHERE `baja` = 0
ORDER BY `id_producto` DESC
SELECT *
FROM `clasificacion`
WHERE `baja_clasif` = 0
SELECT *
FROM `subclasificacion`
WHERE `baja_subclasif` = 0