app/Controllers/UserController.php

SELECT *
FROM `clasificacion`
WHERE `baja_clasif` = 0
SELECT *
FROM `subclasificacion`
WHERE `baja_subclasif` = 0
SELECT *
FROM `provincias`
SELECT *
FROM `localidades`
---
    public function __construct()
    {
        $this->clasificaciones = (new ClasificacionModel())->asArray()->where('baja_clasif', 0)->findAll();
        $this->subclasificaciones = (new SubclasificacionModel())->asArray()->where('baja_subclasif', 0)->findAll();
        $this->provincias = (new ProvinciaModel())->asArray()->findAll();
        $this->localidades = (new LocalidadModel())->asArray()->findAll();

INSERT INTO `usuarios` (`usuario`, `email`, `pass`, `nombre`, `apellido`, `provincia_id`, `localidad_id`, `direccion`, `tel`) VALUES ('juan', 'juanperez@gmail.com', '$2y$10$iFGxiPoum.vfv74mToeO7O2g4emaew8BWPs/RLyJ6qKO9nj1Nhgl2', 'Juan', 'Perez', '8', '929', 'General Paz 1365', '3795698471')
---
    public function registrar()
    {
        $data = [
            'titulo' => 'Registro',
            'rutas' => ['Principal', 'Registro'],
            'link' => ['/', 'registrar'],
            'provincias' => $this->provincias,
            'localidades' => $this->localidades,
            'clasificaciones' => $this->clasificaciones,
            'subclasificaciones' => $this->subclasificaciones
        ];

        if ($this->request->is('post')) {
            $data = [
                'titulo' => 'Registro',
                'rutas' => ['Principal', 'Registro'],
                'link' => ['/', 'registro'],
                'provincias' => $this->provincias,
                'localidades' => $this->localidades,
                'clasificaciones' => $this->clasificaciones,
                'subclasificaciones' => $this->subclasificaciones
            ];

            $usuario = new UsuarioModel();

            if ($usuario->validate($_POST)) {

                $usuario->save($_POST);

SELECT *
FROM `usuarios`
WHERE `usuario` = 'juan'
OR `email` = 'juan'
 LIMIT 1
---
    public function login()
    {
        $data = [
            'titulo' => 'Ingresar usuario',
            'rutas' => ['Principal', 'Ingresar Usuario'],
            'link' => ['/'],
            'clasificaciones' => $this->clasificaciones,
            'subclasificaciones' => $this->subclasificaciones
        ];

        if ($this->request->is('post')) {
            //creo un modelo de usuario para buscar al usuario en la base de datos
            $usuarioModel = new UsuarioModel();
            $usuario = $usuarioModel->where('usuario', $_POST['usuario'])->orWhere('email', $_POST['usuario'])->first();